//基础子程序
#include <string.h>
#include "REG15W4Kxx.h"
#include "delay.h"
#include "main.h"
#include <math.h> 
//#include <adc.h>
#include "SdCard.h"        //加入SD卡相关操作函数
#include "walking.h"
#include "tuxinghua.h"

uchar position[24]={0};    //用于记录24个舵机的位置
/*
        数组对应端口说明：
         position[0]       ━━━━━>>      P6.0          x1舵机  x轴            
         position[1]       ━━━━━>>      P6.1          x2舵机                 
         position[2]       ━━━━━>>      P6.2          x3舵机                 
         position[3]       ━━━━━>>      P6.3          x4舵机                 
         position[4]       ━━━━━>>      P6.4          x5舵机                 
         position[5]       ━━━━━>>      P6.5          x6舵机                 
         position[6]       ━━━━━>>      P6.6          x7舵机                 
         position[7]       ━━━━━>>      P6.7          x8舵机
		                  
         position[8]       ━━━━━>>      P7.0          y1舵机  y轴        
         position[9]       ━━━━━>>      P7.1          y2舵机               
         position[10]      ━━━━━>>      P7.2          y3舵机                 
         position[11]      ━━━━━>>      P7.3          y4舵机                 
         position[12]      ━━━━━>>      P7.4          y5舵机                 
         position[13]      ━━━━━>>      P7.5          y6舵机                 
         position[14]      ━━━━━>>      P7.6          y7舵机                 
         position[15]      ━━━━━>>      P7.7          y8舵机    
		              
         position[16]      ━━━━━>>      P2.0	     		z1舵机  z轴
         position[17]      ━━━━━>>      P2.1	     		z2舵机
         position[18]      ━━━━━>>      P2.2		   		z3舵机
         position[19]      ━━━━━>>      P2.3		   		z4舵机
         position[20]      ━━━━━>>      P2.4		   		z5舵机
         position[21]      ━━━━━>>      P2.5		   		z6舵机
         position[22]      ━━━━━>>      P2.6		   		z7舵机
         position[23]      ━━━━━>>      P2.7		   		z8舵机
*/
uchar position_initial[24];
int position_change[24]; 
//sint16 jichu[24];

uchar pick_up[8];           //各个io口轮流输出是屏蔽其它位
uchar arr[8];               //提供排序空间

uchar t0bit=0;			        //定时器0周期相同标志位
uchar total;			          //千手观音总共的台数M
uchar part;				          //本机所属台数N
uchar change;			          //每个动作的变化量S

//#############################################################################
// 函数名称：low_level_500u(uchar time)
// 函数说明：PWM信号低电平时间子程序，控制舵机PWM信号的低电平时间决定舵机转动的速度
// 入口参数：低电平时间，500u为基础
// 出口参数：无
//#############################################################################
void low_level_500u(sint16 time)
{
  sint16 i; 
  for(i=0;i<time;i++)
  {delay500us(1);}
}
//#############################################################################
// 函数名称：void t0_init(void)
// 函数说明：t0定时器初始化，用于舵机2.5ms定时
// 入口参数：无
// 出口参数：无
//#############################################################################
void t0_init(void)
{
	AUXR |= 0x80;		
	TMOD &= 0xF0;		
	TL0 = 0x00;		
	TH0 = 0x94;		
	TF0 = 0;		
	
  //TMOD  = TMOD & 0xf0;        //初始化定时器1的计数方式为方式1
  //TMOD  = TMOD | 0x01;

  //TH0=0xee;			          //22.1184MHz,2.5Ms定时0xee00
  //TL0=0x00;
  ET0=1;						
  EA=1;
  t0bit=1;
}
//#############################################################################
// 函数名称：low_level_t0(uchar TH,uchar TL)
// 函数说明：同周期定时器0设置及启动程序，使每变化一个变化量的周期相同
// 入口参数：THTL定时器初值。
// 出口参数：无
//#############################################################################
void low_level_t0(uint THTL)
{
  TH0=THTL>>8;			  //22.1184MHz,2.5Ms定时ee00
  TL0=THTL;
  t0bit=0;
  TR0=1;
}
//#############################################################################
// 函数名称：void T0_Interrupt(void) interrupt 1
// 函数说明：PWM信号低电平时间子程序，控制舵机PWM信号的低电平时间决定舵机转动的速度
// 入口参数：低电平时间，500u为基础
// 出口参数：无
//#############################################################################	 
void T0_Interrupt(void) interrupt 1
{  
   TL0=0x00;
	 TH0=0x94;		     //22.1184MHz,2.5Ms定时ee00
   t0bit=1;
}
//#############################################################################
// 函数名称：void ForwardDelay()
// 函数说明：千手观音不同步前延时子程序
// 入口参数：无
// 出口参数：无
//#############################################################################
void ForwardDelay(void)
{
		uchar  i;
		for(i=0;i<(part-1)*change;i++)
		  {
		  delay10ms(1);	 
		  delay10ms(1);	 
		  }	  
}
//#############################################################################
// 函数名称：void BackDelay()
// 函数说明：千手不同步后延时子程序
// 入口参数：无
// 出口参数：无
//#############################################################################
void BackDelay(void)
{
		uchar  i;		
		  for(i=0;i<(total-part)*change;i++)
		  {
		  delay10ms(1);	 
		  delay10ms(1);	 
		  }	  
}
//#############################################################################
// 函数名称：void array( )
// 函数说明：排序子程序，将各个口的8位根据时间的长短排序
// 入口参数：无
// 出口参数：无
//#############################################################################
void array()
{ 
	uchar i=0,j=0,x=0;
	     pick_up[0]=0xFE;
         pick_up[1]=0xFD;
         pick_up[2]=0xFB;
         pick_up[3]=0xF7;
         pick_up[4]=0xEF;
         pick_up[5]=0xDF;
         pick_up[6]=0xBF;
         pick_up[7]=0x7F;
	//排序
	for(i=0;i<=6;i++)
	{         for(j=i+1;j<=7;j++)
         {
                if(arr[i]<arr[j])
                  {             
				            
                           x=arr[j];
						   arr[j]=arr[i];
						   arr[i]=x;
					  
					       x=pick_up[j];
						   pick_up[j]=pick_up[i];
                           pick_up[i]=x;  
                  }
         }}	
	for(i=0;i<=6;i++)
         {
                   arr[i]= arr[i]- arr[i+1];
         } 		
}
//#############################################################################
// 函数名称：int max(uchar total，int M)
// 函数说明：求数组中绝对值最大的元素的子程序
// 入口参数：无
// 出口参数：无
//#############################################################################
int max(uchar total,int M)
{ uchar i;
	//找最大
	for(i=0;i<total;i++)
	{   if (abs(position_change[i])>M)
	        M=abs(position_change[i]);
	}	
		return M;			 
}
//#############################################################################
//函数名称：void p_to_p(int delay)
//函数说明：position 变化子程序，实现同起同落
//入口参数：delay=延时，define:p-to-p决定循环次数由自己决定还是通过程序算出结果决定
//出口参数：无
//#############################################################################
void p_to_p(int delay,int define)
{
   uchar i,j;
   int a,b=0,M=0;
   float c;
   uchar position_buffer[24];	        

   for(i=0;i<24;i++)
   {
   	  position_buffer[i]=position[i];
   }   
   if(define==0)					 //决定循环次数M
   {  M=1;
      M=max(24,M);
	 if(M>50)
       M=50;
	 else if (M>20)
	   M=20;
   }   
   else
   {M=define; 	 					 //循环次数决定完毕
	 }
   for(i=1;i<=M;i++)				 //开始循环M次输出
   {
      for(j=0;j<24;j++)
      {  c=position_change[j];	     //将距离目标点的值分数，一步一步逼近目标值 
         if(i==1)		  
	        a=(c*i)/M;		
		 else
		 {
		    a=(c*i)/M;
			b=(c*(i-1))/M;
		 }
         position[j]+=(a-b);
		}
		PWM_24();
    low_level_500u(delay);
   }  				 		  		 
   for(i=0;i<24;i++) 		  		 //最后补偿每个舵机的误差  		 
   {
      position[i]=position_buffer[i]+position_change[i];
      position_change[i]=0;
   }
  PWM_24();
  low_level_500u(10);   
}

//##############################################################################
//函数名称：void relative(int a1,int a2,int a3,int a4,int a5,int a6)
//函数说明：修正24个舵机的变化量
//入口参数：无
//出口参数：无
//##############################################################################
void relative(int a1,int a2,int a3,int a4,int a5,int a6,int a7,int a8,int a9,\
              int a10,int a11,int a12,int a13,int a14,int a15,int a16,int a17,\
			  int a18,int a19,int a20,int a21,int a22,int a23,int a24)
{
  int *p;
  unsigned char i;
  p=&a1;	  		  
  for(i=0;i<24;i++,p++)
  {	  if(*p==255)
        position_change[i]=0;
		else
	  position_change[i]=*p-position[i]+position_initial[i];
  }
  i=a2=a3=a4=a5=a6=a7=a8=a9=a10=a11=a12=a13=a14=a15=a16=a17=a18=a19=a20=a21=a22=a23=a24;  //无特殊意义
}

//#############################################################################
// 函数名称：void initial_position(void)
// 函数说明：初始位置子程序，根据各个舵机的不同位置设置初始位置。
// 入口参数：无
// 出口参数：无
//#############################################################################
void initial_position(void)                 
{        
	uchar i,j;
  uchar xdata SrcName[10];			// 原文件名缓冲区	
	strcpy(SrcName, "/SHR0/0");   // 在SD卡文件夹SHR0的0文件存放初始位置值
	for(i=0;i<4;i++)
	{			
			if(ReadSdcardFile32Bytes(SrcName) == USB_INT_SUCCESS)
			{
				for(j=0; j<24; j++)
				{
					position[j] = SdcardBuff[j]; 
				}				

				PWM_24();
				low_level_500u(15);				
			}	         
	}                       
	for(i=0;i<24;i++)
	{
		position_initial[i]=position[i];
		position_change[i]=0;
		jichu[i]=0;
	}          			   		               	  
	
} 	

//#############################################################################
// 函数名称：void initial_position(void)
// 函数说明：初始位置子程序，根据各个舵机的不同位置设置初始位置。
// 入口参数：无
// 出口参数：无
//#############################################################################
void initial_position_slow(void)                 
{        
    uchar i;
	                          
    for(i=0;i<24;i++)
    {
        position_change[i]=position_initial[i]-position[i];
	}  
	        			   		               	  
	p_to_p(15,30);
} 
//===========================================================	
void initial_position_slowOne(uchar k)                 
{ 
	if(k == 1) //上半身复位
	{       	                          
		relative(255,255,255,255,255,255,0,0,255,255,255,255,0,0,0,0,0,0,0,0,0,0,0,0); 	        			   		               	  
		p_to_p(10,20);	  
	}
	else
	{
		if(k == 2)	//下半身复位
		{
			relative(0,0,0,0,0,0,255,255,0,0,0,0,255,255,255,255,255,0,0,0,0,0,0,0); 	        			   		               	  
			p_to_p(10,20);			
		}
		else	   //全身复位
		{
			relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0); 	        			   		               	  
			p_to_p(10,20);			
		}
	}
}   
//#############################################################################
//函数名称：void sit_down(uchar step)
//函数说明：蹲下子程序，使机器人处于微蹲状态，便于行走。
//入口参数：setp, 表示下蹲的程度。
//出口参数：无
//#############################################################################
void sit_down(uchar step)
{        
         uchar i;
	 
         for(i=0;i<step;i++)
		    {
			   position[0]--;              //左腿下蹲
			   position[1]+=2;             
			   position[2]++;               
			   
               position[3]++;              //右腿下蹲
			   position[4]-=2;              
			   position[5]--;               
			   PWM_24();
               low_level_500u(25);
			}			
}
//#############################################################################
//函数名称： void stand_up(uchar setp)
//函数说明：起立子程序，有些动作需在站直的情况下做
//入口参数：setp, 表示起立的程度。
//出口参数：无
//#############################################################################
void stand_up(uchar setp)
{        
         uchar i;
		
         for(i=0;i<setp;i++)
		    {
			    position[0]++;             //左褪起立
			    position[1]-=2;            
			    position[2]--;             

                position[3]--;             //右腿起立
			    position[4]+=2;           
			    position[5]++;            
			    PWM_24();
                low_level_500u(25);       		
			}
}	
//#############################################################################
//函数名称： void turn_left(uchar step)
//函数说明：左转子程序
//入口参数：step, 表示左转次数。
//出口参数：无
//#############################################################################
void turn_left(uchar step)
{   uchar k;  

		k=0;
		relative(-20+k,40,20,20-k,-40,-20,0,0,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,20);
	
	    relative(-20+k,40,20,20-k,-40,-20,255,255,-10,10,-10,10,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,15);
	
	    relative(-20+k,40,20,70-k,-80,-15,255,255,-10,15,-20,20,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,15);

	    relative(-5+k,40,35,35-k,-40,-5,255,255,-5,5,-5,5,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,15);

	    relative(-20+k,40,20,20-k,-40,-20,255,255,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,15);
} 
//#############################################################################
//函数名称：void turn_left(uchar step)
//函数说明：右转子程序
//入口参数：step, 表示右转次数。
//出口参数：无
//#############################################################################
 void turn_right(uchar step)
{       uchar k;    

		k=0;
		relative(-20+k,40,20,20-k,-40,-20,0,0,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,20);
	
	    relative(-20+k,40,20,20-k,-40,-20,255,255,10,-10,12,-12,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,15);

        relative(-70+k,80,10,20-k,-40,-20,255,255,20,-20,10,-15,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,15);
	//while(1);
	    relative(-35+k,40,5,5-k,-40,-35,255,255,6,-5,5,-5,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,15);
	//while(1);
	    relative(-20+k,40,20,20-k,-40,-20,255,255,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,15);
 }

//#############################################################################
//函数名称： void l_pyi(uchar step)
//函数说明：左平移子程序
//入口参数：step, 表示左平移次数。
//出口参数：无
//#############################################################################
void l_pyi(uchar step)
{
       uchar k;           

		k=0;
		relative(-20+k,40,20,20-k,-40,-20,0,0,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,20);
	
	    relative(-20+k,40,20,20-k,-40,-20,255,255,5,-5,5,-10,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(5,11);
	
	    relative(-30+k,60,30,20-k,-40,-20,255,255,30,-30,5,-10,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(5,11);
	
	    relative(-20+k,40,20,20-k,-40,-20,255,255,-5,5,-25,25,255,255,255,255,0,0,0,0,0,0,0,0);	   //-5,10,-15,15
	    p_to_p(0,22);
		
	    relative(-20+k,40,20,30-k,-60,-30,255,255,-5,5,-5,5,255,255,255,255,0,0,0,0,0,0,0,0);	  //-5,10
	    p_to_p(0,11);
	
	    relative(-20+k,40,20,20-k,-40,-20,255,255,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
	    p_to_p(0,11);
			
}			
//#############################################################################
//函数名称： void r_pyi(uchar step)
//函数说明：右平移子程序
//入口参数：step, 表示右平移次数。
//出口参数：无
//#############################################################################
void r_pyi(uchar step)
{
    uchar k;

			k=0;
			relative(-20+k,40,20,20-k,-40,-20,0,0,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
		    p_to_p(0,20);
		
		    relative(-20+k,40,20,20-k,-40,-20,255,255,-5,10,-5,5,255,255,255,255,0,0,0,0,0,0,0,0);
		    p_to_p(5,11);
		
		    relative(-20+k,40,20,30-k,-60,-30,255,255,-5,10,-30,30,255,255,255,255,0,0,0,0,0,0,0,0);
		    p_to_p(5,11);
		
		    relative(-20+k,40,20,20-k,-40,-20,255,255,25,-25,5,-5,255,255,255,255,0,0,0,0,0,0,0,0);	 //15,-15,5,-10
		    p_to_p(0,22);
		
		    relative(-30+k,60,30,20-k,-40,-20,255,255,5,-5,5,-5,255,255,255,255,0,0,0,0,0,0,0,0);		   //5,-10
		    p_to_p(0,11);
		
		    relative(-20+k,40,20,20-k,-40,-20,255,255,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
		    p_to_p(0,11);
			   
}
//#############################################################################
//函数名称： void fwc(uchar step)
//函数说明：俯卧撑子程序
//入口参数：step, 表示俯卧撑次数。
//出口参数：无
//#############################################################################
void fwc(uchar step)
{
      uchar i,j;
		  acc_bit=flag_acc_enable;
		  flag_acc_enable=0;
		  
		 relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
	     p_to_p(10,10);
	
         relative(-122,-55,-80,122,55,80,-140,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
        p_to_p(10,40);
		
		relative(-122,-55,-40,122,55,40,-140,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
        p_to_p(10,20);
		
		relative(-60,-55,20,60,55,-20,-140,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
        p_to_p(10,20);
		
		relative(0,0,0,0,0,0,-100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
        p_to_p(10,40);
		
		 
           for(j=0;j<step;j++)           //俯卧撑
		     {
			  for(i=0;i<20;i++)
		      {
			   position[12]-=4;           
			   position[13]+=6;           
			   position[14]+=4;           
    	       position[15]-=6;           
		      PWM_24();
                    low_level_500u(30);
		      }
			for(i=0;i<20;i++)
		      {
			   position[12]+=4;            
			   position[13]-=6;            
			   position[14]-=4;            
    	       position[15]+=6;          
		       PWM_24();
                    low_level_500u(30);
		      }
		   }
		   
		    relative(0,-5,0,0,5,0,-100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
            p_to_p(10,5);
    
			relative(-120,-60,-35,+120,+60,35,-150,150,0,0,0,0,5,0,-5,0,0,0,0,0,0,0,0,0);
	        p_to_p(10,35);
						     							  
			relative(-120,-55,-55,120,55,55,-135,135,0,0,0,0,10,0,-10,0,0,0,0,0,0,0,0,0);
            p_to_p(5,10);		delay10ms(10);	
	                	
	        relative(-110,-50,-80,110,50,80,-100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
            p_to_p(12,20);		
	            		
	        relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
	        p_to_p(10,45);
	       delay10ms(10);
		 flag_acc_enable=acc_bit;
    }					
//#############################################################################
//函数名称： void goal_l(uchar step)
//函数说明：左脚踢球(站立)子程序
//入口参数：step, 表示踢球次数。
//出口参数：无
//#############################################################################
void goal_l(uchar step)
{ 
	uchar i;

	for(i=0;i<step;i++)
	{
		relative(-25,50,25,25,-50,-25,0,0,10,-10,10,-12,0,0,0,0,0,0,0,0,0,0,0,0);
		p_to_p(2,15);
		
		relative(15,70,60,25,-50,-25,0,0,10,-10,0,-18,0,0,0,0,0,0,0,0,0,0,0,0);
		p_to_p(0,18);
		
		relative(-60,50,-5,25,-50,-25,0,0,10,-10,5,-20,0,0,0,0,0,0,-5,0,0,0,0,0);
		p_to_p(0,1);
		
		delay500ms(1);
		relative(-25,50,25,25,-50,-25,0,0,10,-15,5,-15,0,0,0,0,0,0,0,0,0,0,0,0);
		p_to_p(0,25);
		
		relative(-25,50,25,25,-50,-25,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
		p_to_p(0,15);	
	}
}					  
//#############################################################################
//函数名称： void goal_r(uchar step)
//函数说明：右脚踢球(站立)子程序
//入口参数：step, 表示踢球次数。
//出口参数：无
//#############################################################################
void goal_r(uchar step)
{
	uchar i;
		for(i=0;i<step;i++)
		  {
		   relative(-25,50,25,25,-50,-25,0,0,-10,12,-10,10,0,0,0,0,0,0,0,0,0,0,0,0);
		   p_to_p(2,15);
	
		   relative(-25,50,25,-15,-70,-60,0,0,0,18,-10,10,0,0,0,0,0,0,0,0,0,0,0,0);
		   p_to_p(0,18);
		   
		   relative(-25,50,25,60,-50,5,0,0,-5,20,-10,10,0,0,0,0,0,0,0,0,0,0,0,0);
		   p_to_p(0,1);
		   delay500ms(1);
		   relative(-25,50,25,25,-50,-25,0,0,-5,15,-10,15,0,0,0,0,0,0,0,0,0,0,0,0);
		   p_to_p(0,25);
	
		   relative(-25,50,25,25,-50,-25,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
		   p_to_p(0,15); 
	
		  }
}
//#############################################################################
//函数名称： void qianpaxia(void)
//函数说明：前趴下子程序
//入口参数：无
//出口参数：无
//#############################################################################
void qianpaxia(void)
{
	uchar i;
			relative(-130,-55,-80,130,55,80,-140,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(10,40);
			
			relative(-130,-55,-40,130,55,40,-140,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(10,20);
			
			relative(-60,-55,20,60,55,-20,-140,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(10,20);
			
			relative(0,0,0,0,0,0,-100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(10,40);
			
			for(i=0;i<50;i++)
			{
				position[6]+=2;              // 手向后划
				position[7]-=2;              
				PWM_24();
				low_level_500u(40);
			}
			delay1s(1);
}
//#############################################################################
//函数名称： void qianpq(void)
//函数说明：前爬起子程序
//入口参数：无
//出口参数：无
//#############################################################################
void qianpq(void)
{
			relative(0,0,0,0,0,0,0,0,0,0,0,0,-90,0,90,0,0,0,0,0,0,0,0,0);
		    p_to_p(12,10);

            relative(-120,-60,10,+120,+60,-10,-190,190,0,0,0,0,-100,0,100,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,20);
						  
			relative(-120,-60,10,+120,+60,-10,-190,190,0,0,0,0,-40,0,40,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,15);		
			
			relative(-120,-60,-35,+120,+60,35,-150,150,0,0,0,0,5,0,-5,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,15);	   	
						  
			relative(-120,-55,-55,120,55,55,-135,135,0,0,0,0,10,0,-10,0,0,0,0,0,0,0,0,0);
            p_to_p(5,10);		delay10ms(10);	
	                	
	        relative(-110,-50,-80,110,50,80,-100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
            p_to_p(12,20);	
	            		
	        relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
	        p_to_p(10,45);
	        delay10ms(10);	 
}
//#############################################################################
//函数名称： void hp(void)
//函数说明：后趴下子程序
//入口参数：无
//出口参数：无
//#############################################################################
void hp(void)
{
	       relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
		   p_to_p(12,20);
	
		   relative(90,60,60,-90,-60,-60,-85,85,0,0,0,0,-200,0,200,0,0,0,0,0,0,0,0,0);
		   p_to_p(12,25);
	
		   relative(40,120,60,-40,-120,-60,-95,95,0,0,0,0,-200,0,200,0,0,0,0,0,0,0,0,0);
		   p_to_p(12,10);
	
		   relative(0,120,15,0,-120,-15,-95,95,0,0,0,0,-200,0,200,0,0,0,0,0,0,0,0,0);
		   p_to_p(12,15);
	
		   relative(0,0,0,0,0,0,0,0,0,0,0,0,-200,0,200,0,0,0,0,0,0,0,0,0);
		   p_to_p(12,50);
	
		   relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
		   p_to_p(12,5);
	
		   delay10ms(100);
	       initial_position();
	     
}
//#############################################################################
//函数名称：void hp(void)
//函数说明：后爬起子程序
//入口参数：无
//出口参数：无
//#############################################################################
void hpq(void)
{
		    relative(-85,140,-40,85,-140,40,-140,140,0,0,0,0,-190,0,190,0,0,0,0,0,0,0,0,0);
			p_to_p(12,30);
						 		
			relative(80,105,90,-80,-105,-90,-105,105,0,0,0,0,-190,0,190,0,0,0,0,0,0,0,0,0);
			p_to_p(12,25);			
		
					relative(0,105,90,0,-105,-90,-105,105,0,0,0,0,-190,0,190,0,0,0,0,0,0,0,0,0);
					p_to_p(12,30);		
						  
	//		relative(0,125,95,0,-125,-95,-40,40,0,0,0,0,-80,0,80,0,0,0,0,0,0,0,0,0);
	//		p_to_p(12,30);				

			relative(-55,130,75,55,-130,-75,-60,60,0,0,0,0,-110,0,110,0,0,0,0,0,0,0,0,0);
			p_to_p(12,30);			 
			
			relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(12,45);
		
			delay10ms(10);
}
//#############################################################################
//函数名称： void yangwoqizuo(uchar step)
//函数说明：仰卧起坐子程序
//入口参数：step, 表示仰卧起坐的次数。
//出口参数：无
//#############################################################################
void yangwoqizuo(uchar step)
{
         uchar i,j;
		   acc_bit=flag_acc_enable;
	       flag_acc_enable=0;

	   		relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
	        p_to_p(10,10);
            hp();
			delay10ms(10);
		
	      for(i=0;i<2;i++)
		    {
			 position[8]--;              //  双腿合拢 便于弯腰
			 position[9]++;               
			 position[10]++;             
			 position[11]--;              
			  PWM_24();
                    low_level_500u(45);
		     }
		  for(i=0;i<40;i++)
		      {
			   position[6]-=4;               
               position[7]+=4;               
                 PWM_24();
               low_level_500u(35);
		      }
		  for(i=0;i<10;i++)                   
		      {
			   position[0]-=4;               
               position[2]+=4;
               position[3]+=4;               
               position[5]-=4;
			   position[12]+=1;               
               position[13]+=8;
               position[14]-=1;               
               position[15]-=8;
               PWM_24();
               low_level_500u(35);
			   delay1ms(50);
				
		      }
	   for(j=0;j<step;j++)
		   {
			for(i=0;i<38;i++)
		      {
			   position[0]-=2;               
               position[3]+=2;               
               PWM_24();
               low_level_500u(55);
		      }
			for(i=0;i<38;i++)
		      {
			   position[0]+=2;               
               position[3]-=2;               
               PWM_24();
               low_level_500u(55);
		      }
		   }
             delay10ms(10);
		     relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
             p_to_p(15,30);              //调用机器人初始位置子程序
			 delay10ms(10);
			 hpq();      
			  flag_acc_enable=acc_bit;               
}

//#############################################################################
//函数名称：void jingli_l(void)
//函数说明：敬礼（左手）子程序
//入口参数：无
//出口参数：无
//#############################################################################
void jingli_l(void)
{
      uchar i;
	 
      //  stand_up(6);
  
        for(i=0;i<20;i++)
		    {
			   position[6]-=3;  
           	   position[13]+=3;
            			   
			  PWM_24();
                    low_level_500u(45);
		     }
			
	     for(i=0;i<30;i++)
		    {
			   position[0]--;              
			   position[3]++;                 
			  PWM_24();
                    low_level_500u(45);
		     }delay500ms(1);
		 for(i=0;i<30;i++)
		    {
			   position[0]++;              
			   position[3]--;                 
			 PWM_24();
                    low_level_500u(45);
		     }	 delay500ms(1);
         for(i=0;i<20;i++)
		    {
			   position[6]+=3;  
           	   position[13]-=3;
            
			PWM_24();
                    low_level_500u(45);
		     }
	
	//	 sit_down(6);
	    delay500ms(1);

  }
//#############################################################################
//函数名称： void jingli_r(void)
//函数说明：敬礼（右手）子程序
//入口参数：无
//出口参数：无
//#############################################################################
void jingli_r(void)
{
      uchar i;
	
  //  stand_up(6);

   		for(i=0;i<20;i++)
		    {
			   position[7]+=3;  
           	   position[15]-=3;
          			
			  PWM_24();
               low_level_500u(45);
        	
		     }
			  
	  	for(i=0;i<30;i++)
		    {
			   position[0]--;             
			   position[3]++;               
			 PWM_24();
                    low_level_500u(45);
		     }
      		delay1s(1);

  	 	 for(i=0;i<30;i++)
		    {
			   position[0]++;             
			   position[3]--;             
			PWM_24();
                    low_level_500u(45);
		     }
	 	for(i=0;i<20;i++)
		    {
			   position[7]-=3;  
			   position[15]+=3;
 			 PWM_24();
                    low_level_500u(45);
		     }
	//	 sit_down(6);
	     delay500ms(1);
	  
  }

//#############################################################################
//函数名称： void qgf(void)
//函数说明：前滚翻子程序
//入口参数：step, 表示前滚翻次数。
//出口参数：无
//#############################################################################
void qgf(void)
{
    	acc_bit = flag_acc_enable;
   		flag_acc_enable = 0;
	
			relative(-110,-45,-70,110,45,70,-130,130,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(12,30);		 
			
			relative(-70,-45,20,70,45,-20,-100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(12,40);		  
			
			relative(80,75,0,-80,-75,0,-100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
		    p_to_p(12,60);		   
			
			relative(80,75,0,-80,-75,0,-165,165,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(12,30);		  
			
			relative(80,75,0,-80,-75,0,-40,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(12,20);		
						   
			relative(80,75,0,-80,-75,0,-40,40,0,0,0,0,-135,0,135,0,0,0,0,0,0,0,0,0);
			p_to_p(12,20);	
						 		
			relative(80,105,90,-80,-105,-90,-105,105,0,0,0,0,-190,0,190,0,0,0,0,0,0,0,0,0);
			p_to_p(12,25);			
		
					relative(0,105,90,0,-105,-90,-105,105,0,0,0,0,-190,0,190,0,0,0,0,0,0,0,0,0);
					p_to_p(12,30);		
						  
	//		relative(0,125,95,0,-125,-95,-40,40,0,0,0,0,-80,0,80,0,0,0,0,0,0,0,0,0);
	//		p_to_p(12,30);				

			relative(-55,130,75,55,-130,-75,-60,60,0,0,0,0,-110,0,110,0,0,0,0,0,0,0,0,0);
			p_to_p(12,30);			 
			
			relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(12,45);
		 
	    flag_acc_enable = acc_bit;	  
} 
//#############################################################################
//函数名称： void hgf(void)
//函数说明：后滚翻子程序
//入口参数：step, 表示后滚翻次数。
//出口参数：无
//#############################################################################
void hgf(void)
{
		acc_bit = flag_acc_enable;
		flag_acc_enable = 0;

  	        relative(90,60,60,-90,-60,-60,-135,135,0,0,0,0,-195,0,195,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,30);
			
			relative(90,60,0,-90,-60,0,-135,135,0,0,0,0,-195,0,195,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,20);
			
			relative(-120,-60,10,+120,+60,-10,-135,135,0,0,0,0,-195,0,195,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,60);	   
			
			relative(-120,-60,10,+120,+60,-10,-60,60,0,0,0,0,-195,0,195,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,25);	  

			relative(-120,-60,10,+120,+60,-10,-190,190,0,0,0,0,-100,0,100,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,20);	 
						  
			relative(-120,-60,10,+120,+60,-10,-190,190,0,0,0,0,-40,0,40,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,12);	   
						   
			relative(-120,-60,-35,+120,+60,35,-150,150,0,0,0,0,5,0,-5,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,15);	   	
						  
			relative(-120,-55,-55,120,55,55,-135,135,0,0,0,0,10,0,-10,0,0,0,0,0,0,0,0,0);
            p_to_p(5,10);		delay10ms(10);	
	                	
	        relative(-110,-50,-80,110,50,80,-100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
            p_to_p(12,20);		 	
	            		
	        relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
	        p_to_p(10,45);
				
	    delay10ms(10); 
		flag_acc_enable = acc_bit; 		   	     
}   
//#############################################################################
// 函数名称：void daoli(void)
// 功    能：倒立函数
// 入口参数：无
// 出口参数：无
//#############################################################################
void daoli()
{ 
	    acc_bit = flag_acc_enable;
		flag_acc_enable = 0;

			initial_position();             //调用机器人初始位置设定第1族子程序

			relative(-110,-50,-70,110,50,70,-130,130,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(10,30);		  
			
			relative(-70,-50,20,70,50,-20,-105,105,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(10,40);		 

			relative(-115,-50,-50,115,50,50,-125,125,5,-50,-5,50,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(10,20);		 

			relative(30,0,0,-30,0,0,-125,125,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(10,40);		  

			relative(30,0,0,-30,0,0,-130,130,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(10,10);
			delay1s(2);

			relative(-110,-60,10,110,60,-10,-90,90,0,0,0,0,-10,0,10,0,0,0,0,0,0,0,0,0);
	        p_to_p(15,50);
			
			relative(-115,-60,10,115,60,-10,-90,90,0,0,0,0,-100,0,100,0,0,0,0,0,0,0,0,0);
	        p_to_p(10,20);

			relative(-120,-60,10,+120,+60,-10,-190,190,0,0,0,0,-100,0,100,0,0,0,0,0,0,0,0,0);
	        p_to_p(10,20);
						  
			relative(-120,-60,10,+120,+60,-10,-190,190,0,0,0,0,-40,0,40,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,15);
						   
			relative(-120,-60,-35,+120,+60,35,-150,150,0,0,0,0,5,0,-5,0,0,0,0,0,0,0,0,0);
	        p_to_p(12,15);	   	
						  
			relative(-120,-55,-55,120,55,55,-135,135,0,0,0,0,10,0,-10,0,0,0,0,0,0,0,0,0);
            p_to_p(5,10);		delay10ms(10);	
	                	
	        relative(-110,-50,-80,110,50,80,-100,100,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
            p_to_p(12,20);		
	            		
	        relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
	        p_to_p(10,45);

  			flag_acc_enable=acc_bit;
}                                           	
//#############################################################################
// 函数名称：void pch(void)
// 功    能：横劈叉函数
// 入口参数：无
// 出口参数：无
//#############################################################################				 
void pch()
{ 
	       relative(0,0,0,0,0,0,0,0,0,0,0,0,-105,0,105,0,0,0,0,0,0,0,0,0);
	       p_to_p(15,20);

		   relative(0,0,0,0,0,0,0,0,115,-70,-115,70,-105,0,105,0,0,0,0,0,0,0,0,0);
	       p_to_p(15,60);

		   delay1s(2);

		   relative(-50,0,0,50,0,0,0,0,115,-70,-115,70,-105,0,105,0,0,0,0,0,0,0,0,0);
		   p_to_p(12,15);

		   relative(-50,0,0,50,0,0,0,0,50,-70,-50,70,-105,0,105,0,0,0,0,0,0,0,0,0);
		   p_to_p(12,20);

		   relative(-50,0,0,50,0,0,-100,100,0,0,0,0,-105,0,105,0,0,0,0,0,0,0,0,0);
		   p_to_p(12,15);

		    relative(-85,140,-40,85,-140,40,-140,140,0,0,0,0,-190,0,190,0,0,0,0,0,0,0,0,0);
			p_to_p(12,30);
						 		
			relative(80,105,90,-80,-105,-90,-105,105,0,0,0,0,-190,0,190,0,0,0,0,0,0,0,0,0);
			p_to_p(12,25);			
		
					relative(0,105,90,0,-105,-90,-105,105,0,0,0,0,-190,0,190,0,0,0,0,0,0,0,0,0);
					p_to_p(12,30);		
						  
	//		relative(0,125,95,0,-125,-95,-40,40,0,0,0,0,-80,0,80,0,0,0,0,0,0,0,0,0);
	//		p_to_p(12,30);				

			relative(-55,130,75,55,-130,-75,-60,60,0,0,0,0,-110,0,110,0,0,0,0,0,0,0,0,0);
			p_to_p(12,30);			 
			
			relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(12,45);


}
//#############################################################################
// 函数名称：void dt(void)
// 功    能：左单腿直立函数
// 入口参数：无
// 出口参数：无
//#############################################################################
void dt_l(void)
{ uchar i;
		   relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
           p_to_p(10,10);
		 for(i=0;i<50;i++)  
       		{	
			position[12]-=2;
			position[14]+=2;		
			PWM_24();
            low_level_500u(10);
	   		}  
	  

		for(i=0;i<20;i++)  
	       {	
			position[8]+=1;
			position[9]-=1;
			position[10]+=1;
			position[11]-=1;		
			PWM_24();
            low_level_500u(40);
	   		}  
            delay10ms(20);


		for(i=0;i<24;i++)  
	       {	
			position[8]+=4;
				if ((i%3)==0)
			{position[11]-=1; }
			
			PWM_24();
            low_level_500u(115);
	   	 }  
		delay1s(2);
		for(i=0;i<24;i++)  
	       {	
			position[8]-=4;
				if ((i%3)==0)
			{position[11]+=1; }
			
			PWM_24();
            low_level_500u(115);
	   	 } 
       delay10ms(20);
		   
	 for(i=0;i<10;i++)  
	       {	
			position[8]-=2;
		    position[9]+=2;
			position[10]-=2;
			position[11]+=2;		
			PWM_24();
		    low_level_500u(85);
	       }  
		delay10ms(2);
		 initial_position();               //调用机器人初始位置子程序  
}
//#############################################################################
// 函数名称：void dt(void)
// 功    能：右单腿直立函数
// 入口参数：无
// 出口参数：无
//#############################################################################
void dt_r(void)
{ 		uchar i;
           relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
           p_to_p(10,10);
		 
		 for(i=0;i<50;i++)  
       		{	
			position[12]-=2;
			position[14]+=2;		
			PWM_24();
            low_level_500u(10);
	   		}  
	  

		for(i=0;i<20;i++)  
	       {	
			position[8]-=1;
			position[9]+=1;
			position[10]-=1;
			position[11]+=1;		
			PWM_24();
            low_level_500u(40);
	   		}  
  		delay10ms(20);


		for(i=0;i<24;i++)  
	       {	
			position[10]-=4;
				if ((i%3)==0)
			   {position[9]+=1; }
						
			PWM_24();
            low_level_500u(115);
	   	  }  
	         delay1s(2);
		for(i=0;i<24;i++)  
	       {	
			position[10]+=4;
				if ((i%3)==0)
			   {position[9]-=1; }
						
			PWM_24();
            low_level_500u(115);
	   	  } 
		delay10ms(20);
		   
	 for(i=0;i<10;i++)  
	       {	
			position[8]+=2;
		    position[9]-=2;
			position[10]+=2;
			position[11]-=2;		
			PWM_24();
            low_level_500u(85);
	   		}  
		delay10ms(2);
		 initial_position();               //调用机器人初始位置子程序  
}
//#############################################################################
// 函数名称：void taijiaozi(void)
// 功    能：抬轿子子程序
// 入口参数：无
// 出口参数：无
//#############################################################################	 
void taijiaozi(void)
{
		uchar i;
		
			position_change[8]=10;
			position_change[9]=-10;
			position_change[10]=10;
			position_change[11]=-10;
			p_to_p(65,0);
		  for(i=0;i<3;i++)
			{
			position_change[8]=-20;
			position_change[9]=20;
			position_change[10]=-20;
			position_change[11]=20;
			p_to_p(65,0);
				
			position_change[8]=20;
			position_change[9]=-20;
			position_change[10]=20;
			position_change[11]=-20;
			p_to_p(65,0);
			}

			position_change[8]=-10;
			position_change[9]=10;
			position_change[10]=-10;
			position_change[11]=10;
			p_to_p(65,0);
				
				
				walk(3);		//行走子程序
}							
//#############################################################################
// 函数名称：void wudao(void)
// 功    能：舞蹈子程序
// 入口参数：无
// 出口参数：无
//#############################################################################	 
void wudao(void)
{                     
             uchar i;
					 relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
                  	p_to_p(10,15);
					  position_change[14]=120;
					 position_change[12]=-30;
      				 position_change[16]=-50;
					 position_change[15]=-30;
					 position_change[13]=-30;	
					 
					 
					 position_change[8]=30;
					 position_change[10]=25;
				    position_change[11]=-25;
				    position_change[9]=-30;
					p_to_p(0,40);

					 position_change[3]=30;           
			         position_change[4]=-60;             
			        position_change[5]=-30; 
					 
				    position_change[8]=20;
					position_change[11]=-5;
					                       
					p_to_p(0,40);

			        position_change[14]=60;
					position_change[12]=30;
      				position_change[16]=-30;
					position_change[15]=-35;
					position_change[13]=-35;   
					
					position_change[1]=100;
					 position_change[2]=30;	  
						  p_to_p(0,40);			   
					
					position_change[3]=-30;             
			        position_change[4]=60; 
					position_change[5]=30; 
					p_to_p(0,40);
					position_change[1]=-100;
					position_change[2]=-30;
					p_to_p(0,40);
					position_change[10]=-25;
				    position_change[11]=30;
				    position_change[9]=30;
				    position_change[8]=-50; 	 	
					   p_to_p(0,40);
			     	position_change[16]=45;
					position_change[15]=65;
					position_change[12]=-135;
					position_change[13]=60;
					position_change[14]=-30;	  
				
						   p_to_p(0,40);
					position_change[12]=130;
					position_change[14]=-135;
					position_change[16]=30;
						      
						p_to_p(0,40);
					   delay10ms(10);
				  
				  
				    position_change[14]=-15;	                     
					position_change[12]=10;
						p_to_p(0,40);
			
			        position_change[14]=150;
					 position_change[12]=-30;
      				 position_change[16]=-80;
					 position_change[15]=-50;
					 position_change[13]=-40;
				           p_to_p(0,40); 




					position_change[14]=-110;
					 position_change[12]=-90;
      				 position_change[16]=125;
					 position_change[15]=80;
					 position_change[13]=60; 
				
				
					position_change[8]=-25;
				    position_change[10]=-30;
				    position_change[9]=25;
				    position_change[11]=30;
					  p_to_p(0,40);
					
					 position_change[0]-=30;              
			         position_change[1]=60;              
			         position_change[2]=30;             

				    position_change[10]=-20;
					position_change[9]=5;			  
					     p_to_p(0,40);
						position_change[16]=35;
					position_change[12]=-60;
					position_change[14]=-30;
					position_change[15]=40;
					position_change[13]=40;	
					
					position_change[4]=-100;
					position_change[5]=-30;	 
					 
						  p_to_p(0,40);			  
				    
					position_change[0]=30;             
			        position_change[1]=-60;             
			        position_change[2]=-30;    
				     p_to_p(0,40);
					position_change[4]=100;
					position_change[5]=30;	 
					  p_to_p(0,40);
					position_change[8]=25;
				    position_change[10]=30;
				    position_change[9]=-30;
				    position_change[11]=-30;
					 position_change[10]=50;

					position_change[16]=-130;
					position_change[15]=-100;
					position_change[14]=160;
						   p_to_p(0,40);
			
			       position_change[12]=150;
					position_change[14]=-155;
					position_change[13]=-50;
					position_change[15]=45;
					position_change[16]=40;
					 p_to_p(0,40);
				   position_change[16]=20;
				   position_change[15]=-20;
				   position_change[14]=-10;
				   position_change[13]=-10;
				   position_change[12]=20;
				    p_to_p(0,40); 
				 
				relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
	            p_to_p(0,10);
				
				
					  for(i=0;i<25;i++)
		       {
			   position[0]--;              //z1     左腿下蹲
			   position[1]+=2;              //z2   
			   position[2]++;              //z3   
			   
               position[3]++;              //z4     右腿下蹲
			   position[4]-=2;              //z5   
			   position[5]--;              //z6   
			  
			   PWM_24();
               low_level_500u(44);
	           }
				
             for(i=0;i<25;i++)
		     {
			   position[0]++;              //z1    左腿抬起
			   position[1]-=2;              //z2  
			   position[2]--;              //z3   
			   
               position[3]--;              //z4    右腿抬起
			   position[4]+=2;              //z5  
			   position[5]++;              //z6   
			  
			   PWM_24();
               low_level_500u(18);
            	}
			 for(i=0;i<25;i++)
		    {
			   position[0]--;              //z1    左腿下蹲
			   position[1]+=2;              //z2   
			   position[2]++;              //z3   
			   
               position[3]++;              //z4    右腿下蹲
			   position[4]-=2;              //z5  
			   position[5]--;              //z6   
			   
			   PWM_24();
               low_level_500u(20);
	          }
			  for(i=0;i<25;i++)
		    {
			   position[0]++;              //z1   左腿抬起
			   position[1]-=2;              //z2  
			   position[2]--;              //z3   
			   
               position[3]--;              //z4   右腿抬起
			   position[4]+=2;              //z5  
			   position[5]++;              //z6   
			   PWM_24();
               low_level_500u(20);
             }										
          
            for(i=0;i<25;i++)
		       {
			   position[0]--;              //z1   左腿下蹲
			   position[1]+=2;              //z2   
			   position[2]++;              //z3  
			   
               position[3]++;              //z4  右腿下蹲
			   position[4]-=2;              //z5  
			   position[5]--;              //z6   			   
               position[7]+=4;
			   

			   PWM_24();
               low_level_500u(19);
               }
             for(i=0;i<25;i++)
		      {
			   position[0]++;              //z1     左腿抬起
			   position[1]-=2;              //z2  
			   position[2]--;              //z3   
			   
               position[3]--;              //z4   右腿抬起
			   position[4]+=2;              //z5  
			   position[5]++;              //z6   
			   
			   position[6]-=4;
			   PWM_24(); 
			   low_level_500u(19);
	           }
			   for(i=0;i<25;i++)
		    {
			   position[0]--;              //z1    左腿下蹲
			   position[1]+=2;              //z2   
			   position[2]++;              //z3   
			   
               position[3]++;              //z4    右腿下蹲
			   position[4]-=2;              //z5   
			   position[5]--;              //z6  
			   
               position[13]-=4;
			   position[15]-=4;
			   
			   position[16]+=2;
			   PWM_24();
               low_level_500u(19);
                }

           for(i=0;i<25;i++)
		    {
			   position[0]++;              //z1   左腿抬起
			   position[1]-=2;              //z2  
			   position[2]--;              //z3   
			   
               position[3]--;              //z4   右腿抬起
			   position[4]+=2;              //z5   
			   position[5]++;              //z6   
			   position[16]-=2;
               position[13]+=4;
			   position[15]+=4;
				
				PWM_24(); 
			  low_level_500u(19);
		     }
            for(i=0;i<25;i++)
		    {
			   position[0]--;              //z1    左腿下蹲
			   position[1]+=2;              //z2  
			   position[2]++;              //z3   
			   			   
               position[3]++;              //z4   右腿下蹲
			   position[4]-=2;              //z5  
			   position[5]--;              //z6   
			   
               position[13]+=4;
			   position[15]-=4;

			   PWM_24();
               low_level_500u(19);
               }
			   for(i=0;i<25;i++)
		    {
			   position[0]++;              //z1   左腿抬起
			   position[1]-=2;              //z2 
			   position[2]--;              //z3  
			   
               position[3]--;              //z4    右腿抬起
			   position[4]+=2;              //z5  
			   position[5]++;              //z6   
			   
               position[7]-=1;
			   position[6]-=1;
				PWM_24(); 
			  low_level_500u(19);
		     }
			 for(i=0;i<25;i++)
		    {
			   position[0]--;              //z1   左腿下蹲
			   position[1]+=2;              //z2  
			   position[2]++;              //z3  
			   
               position[3]++;              //z4   右腿下蹲
			   position[4]-=2;              //z5  
			   position[5]--;              //z6   
			   
               position[7]+=2;
			   position[6]+=2;
              
			   PWM_24();
              low_level_500u(19);
             }
			for(i=0;i<25;i++)
		    {
			   position[0]+=1;              //z1    左腿抬起
			   position[1]-=2;              //z2  
			   position[2]--;              //z3   
			   
               position[3]--;              //z4   右腿抬起
			   position[4]+=2;              //z5 
			   position[5]++;              //z6   
			   			   
               position[7]-=2;
			   position[6]-=2;
				PWM_24(); 
			  low_level_500u(19);
		     }

			for(i=0;i<25;i++)
		    {
			   position[0]-=1;              //z1    左腿下蹲
			   position[1]+=2;              //z2   
			   position[2]+=1;              //z3   
			   
               position[3]+=1;              //z4  右腿下蹲
			   position[4]-=2;              //z5   
			   position[5]-=1;              //z6   
			   
               position[7]+=1;
			   position[6]+=1;
			  
			   position[13]-=3;
			   position[15]+=3;
			    position[12]-=4;
			   position[14]+=4;
			   
			 
               PWM_24();
               low_level_500u(19);
            }
		
		  for(i=0;i<25;i++)
		    {
             position[12]+=4;
			   position[13]+=3;
			   position[16]-=2;
			

				PWM_24(); 
           		  low_level_500u(19);
			}
			for(i=0;i<25;i++)
		    {
              position[13]-=3;
			  position[14]-=4;
			   position[16]+=2;
			  	PWM_24(); 
			  low_level_500u(19);
			}

			for(i=0;i<25;i++)
		    {
			  position[15]+=1;
			  position[13]-=1;
			 
			  position[7]-=4;
			  position[6]+=4;
				PWM_24(); 
			  low_level_500u(20);
			}
		for(i=0;i<25;i++)
               {
			   position[12]-=8;		   //向上抬起    左肩	  
		   	   position[14]+=8;		   //向上抬起    右肩	  

               PWM_24();
              low_level_500u(30);
			   }
				 	

			 	for(i=0;i<25;i++)
                {
               position[16]-=2;		      //头向右转
			   position[14]-=4;			  //右肩向下   下到水平位置
		   	   position[15]+=4;			  //右臂    垂直			同时双腿下蹲↓

			   position[0]--;              //z1     左腿下蹲
			   position[1]+=2;              //z2   
			   position[2]++;              //z3  
			   
               position[3]++;              //z4     右腿下蹲
			   position[4]-=2;              //z5   
			   position[5]--;              //z6   

			   PWM_24();
               low_level_500u(21);
			   }

			  for(i=0;i<25;i++)
               {
				position[16]+=4;		   //头转向左边
			   position[12]+=4;			   //左肩向下   下到水平位置
		   	   position[13]-=4;			   //左臂    垂直			同时双腿抬起↓
			   position[0]++;              //z1     左腿抬起
			   position[1]-=2;              //z2  
			   position[2]--;              //z3  
			   
               position[3]--;              //z4    右腿抬起
			   position[4]+=2;              //z5   
			   position[5]++;              //z6  

			   PWM_24();
               low_level_500u(21);
		       }
         for(i=0;i<25;i++)
             {

			position[16]-=4;				//头转向右边
			position[15]-=4;					 //右手臂     变到水平位置		  同时双腿下蹲↓
			position[0]--;              //z1   190+28=218   左腿下蹲
			   position[1]+=2;              //z2   91+2*28=147
			   position[2]++;              //z3   133-28=105
			   
               position[3]++;              //z4   101-28=73    右腿下蹲
			   position[4]-=2;              //z5   158-2*28=102
			   position[5]--;              //z6   149+28=177


			   PWM_24();
               low_level_500u(21);
			   }
			   for(i=0;i<25;i++)
               {
			   position[16]+=4;				//头向右转
		   	   position[13]+=4;				   //左手臂   向下到水平位置     同时双腿抬起↓
			   position[0]++;              //z1   190+28=218   左腿抬起
			   position[1]-=2;              //z2   91+2*28=147
			   position[2]--;              //z3   133-28=105
			   
               position[3]--;              //z4   101-28=73    右腿抬起
			   position[4]+=2;              //z5   158-2*28=102
			   position[5]++;              //z6   149+28=177

			   PWM_24();
               low_level_500u(21);
		       }		
			
				for(i=0;i<25;i++)
               {

			position[16]-=4;			  //头向右转
			position[15]-=4;				   //右手臂向下  变成    向下90度      	 同时双腿下蹲↓
			position[0]--;              //z1   190+28=218   左腿下蹲
			position[1]+=2;              //z2   91+2*28=147
			position[2]++;              //z3   133-28=105
			   
            position[3]++;              //z4   101-28=73    右腿下蹲
			position[4]-=2;              //z5   158-2*28=102
			position[5]--;              //z6   149+28=177


			   PWM_24();
               low_level_500u(21);
		      }
					 
				for(i=0;i<25;i++)
               {
			   position[16]+=4;			//头向左转
		   	   position[13]+=4;					//左手臂向下   变成   向下90度    同时双腿抬起↓
			   position[0]++;              //z1   190+28=218   左腿抬起
			   position[1]-=2;              //z2   91+2*28=147
			   position[2]--;              //z3   133-28=105
			   
               position[3]--;              //z4   101-28=73    右腿抬起
			   position[4]+=2;              //z5   158-2*28=102
			   position[5]++;              //z6   149+28=177

			   PWM_24();
               low_level_500u(21);
		         }	

			   for(i=0;i<25;i++)
                {
                position[13]-=6;			    //左手臂抬起   		 。。。。。。第一台机器人   应该-4
			   position[15]+=4;		    	//右手臂抬起   到水平位置


			   PWM_24();
               low_level_500u(21); 
			    }		 
				 								   //第一台机器人   这  中间应该   延时。。。。

																			   					
               for(i=0;i<25;i++)

	 		    {
			   position[16]-=1;			   //头向右转
		   	   position[13]+=6;			   //左手臂向下放
			   position[12]-=2;			   //左肩上抬起
               
			   PWM_24();
               low_level_500u(21);
		  	    }		 
		
           for(i=0;i<25;i++)
            {
			position[16]-=1;				  //头向右转		  、、、头转到中间	  此时
		    position[13]-=4;					  //左手臂抬起
			position[12]+=2;					  //左肩向下 		 、、左手恢复到平举
		
			   PWM_24();
             low_level_500u(21);
	       }		
		   for(i=0;i<25;i++)

	{
	position[16]-=1;			   //头向右转		   。。  右45度左右
	position[14]+=2;				   //右肩向上抬
	position[15]-=4;				   //右手臂向下放 		   。。   右手弯曲  状态


	PWM_24();

	low_level_500u(21);
				 
     }		
for(i=0;i<25;i++)

	{
	position[16]-=1;			 //头向右转
	position[14]-=2;				 //右肩向下放
	position[15]+=6;				 //右手臂向上抬起			 。。  右手恢复到平   再稍向上一些、、


	 PWM_24();
     low_level_500u(21);
    }
	for(i=0;i<25;i++)
    {

	position[16]+=2;			//头向左转		 、、、头恢复到  中间
	position[15]-=2;			//右臂向下	   右手臂恢复到     平举 


	 PWM_24();
     low_level_500u(21);
	}
	  
	for(i=0;i<25;i++)
    {
    position[6]-=4;			   //转90度     变成  手心向前
	position[13]+=4;		   //向前转90度
	position[14]-=4;		   //右肩变成    垂直于地面   90度角	  手向地面
	position[12]+=4;		   //加90度角    变成		手臂在胸腔

	 PWM_24();
	low_level_500u(25);	   
    }  

    for(i=0;i<25;i++)		  //张开手臂
    {

	position[13]-=4;		//左手臂向外90度
	position[12]-=4;		//左肩向外90度
	position[16]+=4;		//头向左转

	 PWM_24();
	low_level_500u(25);	   
     } 


	for(i=0;i<25;i++)	   //收手臂
    {
	position[13]+=4;		   //	  重复以上动作↑↑
	position[12]+=4;		   //
	position[16]-=4;		   //	   头到中间

	PWM_24();
	low_level_500u(25);	   
    } 

	for(i=0;i<25;i++)		  //张开手臂
  {
	position[13]-=4;			//     重复以上动作↑↑
	position[12]-=4;			//  			手臂都张开    平、、、
	position[16]+=4;			//		头向左边转

	 PWM_24();
	 low_level_500u(25);	   
    } 		
			
	for(i=0;i<25;i++)	  //收手臂
  {
	position[13]+=4;			   //重复以上动作↑↑
	position[12]+=4;			        	//手臂都收到胸前
	position[16]-=4;			 // 头恢复到  中间位置

    PWM_24();
	low_level_500u(25);	   
   } 		

   for(i=0;i<25;i++)
  {
    position[6]+=4;		 //左肩向         前  （下）   转  90度 
	position[13]-=4;	 //左手臂向外90度    垂直于地面
	PWM_24();
    low_level_500u(25);	   
   	}  	
	delay10ms(10);

	
    position_change[12]=-140; 
   position_change[16]=90; 
     p_to_p(0,50);
   
   delay10ms(10);
   position_change[12]=140; 
   position_change[16]=-90; 						//还原初始化			 
   p_to_p(0,50);

    relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
	p_to_p(0,40);


}
//#############################################################################
//函数名称： void fuwei()
//函数说明：复位子程序
//入口参数：
//出口参数：无
//#############################################################################
void fuwei()
{
	relative(-25,50,25,25,-50,-25,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
	p_to_p(15,15);
}  
//#############################################################################
//函数名称： void zuogouqiu()
//函数说明：左勾球子程序
//入口参数：
//出口参数：无
//#############################################################################
void zuogouqiu()
{
			relative(-80,160,80,0,0,0,0,0,20,20,0,40,-80,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(15,30);
			
			relative(-80,160,80,60,-120,-60,0,0,20,0,0,20,-10,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(15,25);
			
			relative(-25,50,25,25,-50,-25,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(15,25);
		
			relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
		    p_to_p(10,15);
}

//#############################################################################
//函数名称： void yougouqiu()
//函数说明：左勾球子程序
//入口参数：
//出口参数：无
//#############################################################################
void yougouqiu()
{
			relative(0,0,0,80,-160,-80,0,0,0,-40,-20,-20,0,0,80,0,0,0,0,0,0,0,0,0);
			p_to_p(15,30);
			
			relative(-60,120,60,80,-160,-80,0,0,0,-20,-20,0,0,0,10,0,0,0,0,0,0,0,0,0);
			p_to_p(15,25);
			
			relative(-25,50,25,25,-50,-25,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
			p_to_p(15,25);
		
			relative(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0);
		    p_to_p(10,15);
}



