// 行走子程序
#include <math.h>
//#include "REG15W4Kxx.h"
#include "delay.h"
#include "main.h"
#include "basal.h"

//#############################################################################
//函数名称： void left_cs(uchar setp)
//函数说明：左侧身子程序
//入口参数：step, 表示左侧身的幅度
//出口参数：无
//#############################################################################
void left_cs(uchar setp)
{ uchar i;
   for (i=0;i<setp;i++)
   {
		position[8]-=1;
		position[9]+=1;
		position[10]-=1;
		position[11]+=1;
		PWM_24();
        low_level_500u(18);
   }
}
//#############################################################################
//函数名称：void right_cs(uchar setp)
//函数说明：右侧身子程序
//入口参数：step, 表示右侧身的幅度
//出口参数：无
//#############################################################################
void right_cs(uchar setp)
{ uchar i;
   for (i=0;i<setp;i++)
   {
			     position[8]+=1;
				 position[9]-=1;
				 position[10]+=1;
				 position[11]-=1;
				 PWM_24();
                 low_level_500u(18);
   }
}
//#############################################################################
//函数名称： void left_up(uchar setp)
//函数说明：抬左腿子程序
//入口参数：step, 表示抬左腿的高度
//出口参数：无
//#############################################################################
void left_up(uchar setp)
{ uchar i;
   for (i=0;i<setp;i++)
   {
			     position[0]-=2;
				 position[1]+=4;
				 position[2]+=2;
				 position[8]+=1;
				 position[9]-=1;
				 position[10]+=1;
				 position[11]-=1;
			
				    PWM_24();
                 low_level_500u(18);								
   }
}
//#############################################################################
//函数名称： void right_up(uchar setp)
//函数说明：抬右腿子程序
//入口参数：step, 表示抬右腿的高度
//出口参数：无
//#############################################################################
void right_up(uchar setp)
{ uchar i;
   for (i=0;i<setp;i++)
   {
	             position[8]-=1;
				 position[9]+=1;
				 position[10]-=1;
				 position[11]+=1;
			     position[3]+=2;
				 position[4]-=4;
				 position[5]-=2;
				   PWM_24();
                 low_level_500u(18);
   }
}
//#############################################################################
//函数名称：void left_forward(uchar setp)
//函数说明：迈左腿子程序
//入口参数：step, 表示左腿前进的程度
//出口参数：无
//#############################################################################
void left_forward(uchar setp)
{ uchar i;
   for (i=0;i<setp;i++)
   {
			     position[0]-=1;
				 position[2]-=1;
				 position[3]-=1;
				 position[5]-=1;
				   PWM_24();
                 low_level_500u(18);								
   }
}
//#############################################################################
//函数名称：void right_forward(uchar setp)
//函数说明：迈右腿子程序
//入口参数：step, 表示右腿前进的程度
//出口参数：无
//#############################################################################
void right_forward(uchar setp)
{ uchar i;
   for (i=0;i<setp;i++)
   {
			     position[0]+=1;
				 position[2]+=1;
				 position[3]+=1;
				 position[5]+=1;
				   PWM_24();
                 low_level_500u(18);							
   }
}
//#############################################################################
//函数名称：void left_down(uchar setp)
//函数说明：落左腿子程序
//入口参数：step, 表示左腿落下的程度
//出口参数：无
//#############################################################################
void left_down(uchar setp)
{ uchar i;
   for (i=0;i<setp;i++)
   {
                 position[0]+=2;
				 position[1]-=4;
				 position[2]-=2;
				 position[8]-=1;
				 position[9]+=1;
				 position[10]-=1;
				 position[11]+=1;
				   PWM_24();
                 low_level_500u(18); 
   }
}									
//#############################################################################
//函数名称：void right_down(uchar setp)
//函数说明：落右腿子程序
//入口参数：step, 表示右腿落下的程度
//出口参数：无
//#############################################################################
void right_down(uchar setp)
{ uchar i;
   for (i=0;i<setp;i++)
   {
				 position[8]+=1;
				 position[9]-=1;
				 position[10]+=1;
				 position[11]-=1;
			     position[3]-=2;
				 position[4]+=4;
				 position[5]+=2;
				   PWM_24();
                 low_level_500u(18);								
    }
}
//#############################################################################
//函数名称： void walk(uchar setp)
//函数说明：前进子程序
//入口参数：step, 表示前进的步数
//出口参数：无
//#############################################################################
void walk(uchar setp)					
{	
		uchar  i;
		//mp3_send(0x00,0x00,30);		
		sit_down(50);
		delay500ms(1);
		
		//抬右腿半步子程序
		left_cs(12);						//左侧身	
		right_up(10);						//抬右腿
		right_forward(12);                 //迈右腿               
		right_down(10);                    //放右腿                     
		right_cs(12);                      //右侧身                         
			 
			 //前进循环
		  for(i=0;i<setp/2;i++)
		  {	  	//mp3_send(0x00,0x00,0x02);
 			 right_cs(12);                   //右侧身   
			 left_up(10);						//抬左腿
 			 left_forward(24);					//迈左腿
             left_down(10);						//放左腿
			 left_cs(12);						//左侧身
				
			  
			 left_cs(12);						//左侧身
			 right_up(10);						//抬右腿
			 right_forward(24);					//迈右腿
			 right_down(10);                    //放右腿  
			 right_cs(12);                      //右侧身


			 right_cs(12);                      //右侧身   
			 left_up(10);						//抬左腿
 			 left_forward(24);					//迈左腿
             left_down(10);						//放左腿
			 left_cs(12);						//左侧身
				
			  
			 left_cs(12);						//左侧身
			 right_up(10);						//抬右腿
			 right_forward(24);					//迈右腿
			 right_down(10);                    //放右腿  
			 right_cs(12);                      //右侧身
				
		  }	
		  	//抬左腿半步子程序 
			 right_cs(12);                      //右侧身
			 left_up(10);						//抬左腿
 			 left_forward(12);					//迈左腿
             left_down(10);						//放左腿
			 left_cs(12);						//左侧身

			 stand_up(50);			 	   
}

//#############################################################################
//函数名称： void houtui(uchar setp)
//函数说明：后退子程序
//入口参数：step, 表示前进的步数
//出口参数：无
//#############################################################################
void houtui(uchar setp)					
{	
		uchar  i;
		sit_down(50);
		delay500ms(1);

		 //抬右腿半步子程序
	     left_cs(12);						//左侧身	
         right_up(10);						//抬右腿
		 left_forward(12);                 //迈右腿 （即前进的迈左腿子程序）              
		 right_down(10);                    //放右腿                     
		 right_cs(12);                      //右侧身                         
			 
			 //前进循环
		  for(i=0;i<setp/2;i++)
		  {	  
 			 right_cs(12);                      //右侧身   
			 left_up(10);						//抬左腿
 			 right_forward(24);					//迈左腿 （即前进的迈右腿子程序）
             left_down(10);						//放左腿
			 left_cs(12);						//左侧身
				
			  
			 left_cs(12);						//左侧身
			 right_up(10);						//抬右腿
			 left_forward(24);					//迈右腿 （即前进的迈左腿子程序）
			 right_down(10);                    //放右腿  
			 right_cs(12);                      //右侧身


			 right_cs(12);                      //右侧身   
			 left_up(10);						//抬左腿
 			 right_forward(24);					//迈左腿 （即前进的迈右腿子程序）
             left_down(10);						//放左腿
			 left_cs(12);						//左侧身
				
			  
			 left_cs(12);						//左侧身
			 right_up(10);						//抬右腿
			 left_forward(24);					//迈右腿 （即前进的迈左腿子程序）
			 right_down(10);                    //放右腿  
			 right_cs(12);                      //右侧身
				
		  }	
		  	//抬左腿半步子程序 
			 right_cs(12);                      //右侧身
			 left_up(10);						//抬左腿
 			 right_forward(12);					//迈左腿 （即前进的迈右腿子程序）
             left_down(10);						//放左腿
			 left_cs(12);						//左侧身

			 stand_up(50);

}
//#############################################################################
//函数名称： void kuaizou1(uchar setp)
//函数说明：快走1子程序
//入口参数：
//出口参数：无
//#############################################################################
void kuaizou1(void)					
{	
	uchar k;
		k = 0;
	relative(-25+k,50,25,25-k,-50,-25,255,255,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,22);
//------------------------------------------------------------------------------
	relative(-25+k,50,25,25-k,-50,-25,255,255,8,-8,8,-10,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);
	
	relative(-60+k,90,30,25-k,-60,-35,255,255,12,-12,8,-12,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);
	  
}

//#############################################################################
//函数名称： void kuaizou2(uchar setp)
//函数说明：快走2子程序
//入口参数：
//出口参数：无
//#############################################################################
void kuaizou2(void)					
{	
	uchar k;
		k = 0;

	relative(-35+k,72,35,-10-k,-75,-70,-10,0,-10,10,-14,14,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);
	
	relative(-25+k,62,35,60-k,-90,-30,-15,-5,-10,12,-14,14,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);
							  delay10ms(2);
	relative(10+k,77,70,35-k,-70,-35,0,10,10,-10,8,-12,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);
	
	relative(-60+k,92,30,25-k,-60,-35,5,15,10,-10,8,-8,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);			   

}

//#############################################################################
//函数名称： void houtui1(uchar setp)
//函数说明：后退1子程序
//入口参数：
//出口参数：无
//#############################################################################
void houtui1(void)					
{	
	uchar k;
		k = 0;
	
	relative(-25+k,50,25,25-k,-50,-25,255,255,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,22);
	//------------------------------------------------------------------------------
	relative(-25+k,50,25,25-k,-50,-25,255,255,-8,10,-8,8,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);	
	
	relative(-35+k,70,35,-10-k,-75,-70,255,255,-10,10,-14,14,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);
	
	relative(-60+k,90,26,25-k,-60,-35,255,255,10,-10,8,-8,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);
}

//#############################################################################
//函数名称： void houtui2(uchar setp)
//函数说明：后退2子程序
//入口参数：
//出口参数：无
//#############################################################################
void houtui2(void)					
{	
	uchar k;
		k = 0;

	relative(10+k,77,70,35-k,-70,-35,-10,0,10,-10,8,-12,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);	
	
	relative(-25+k,62,35,60-k,-90,-30,-15,-5,-10,12,-14,14,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);
					   delay10ms(2);
	//relative(-35+k,72,35,-10-k,-75,-70,12,12,-10,10,-14,14,255,255,255,255,0);
	relative(-35+k,70,35,-10-k,-75,-70,0,10,-10,10,-14,14,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);
	
	//relative(-60+k,92,30,25-k,-60,-35,0,0,10,-10,8,-8,255,255,255,255,0);
	relative(-60+k,90,26,25-k,-60,-35,5,15,10,-10,8,-8,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(4,14);	
	    
}
//准备状态
void Start_Status(char k,char value3)
{
	relative(-20+k,40,20,20-k,-40,-20,0,0,0,0,0,0,255,255,255,255,0,0,0,0,0,0,0,0);
	p_to_p(value3,25);
}





